app/Controllers/Admin.php

    public function orders($status) {
        $session = session();
        if (!$session->get('username')) {
            return redirect()->to('/admin');
        }
        $orderModel = new OrderModel();
        $customerModel = new CustomerInformationModel();
        $orderDetailsModel = new OrderDetailsModel();
        $productModel = new ProductsModel();

        $orders = $orderModel->where('order_status', $status)->findAll();
---
SELECT *
FROM `orders`
WHERE `order_status` = 'Confirmed'