app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `payment_status` = 'Pending'
SELECT COUNT(*) AS `numrows`
FROM `feedback`
---
    public function dashboard() {
        $session = session();
        $orderModel = new OrderModel();
        if (!$session->get('username')) {
            return redirect()->to('/admin'); // Adjust login route accordingly
        }

        $db = \Config\Database::connect();

        // Pending orders count
        $pendingOrders = 0;
        try {
            $query = $db->table('orders')->where('payment_status', 'Pending')->countAllResults();
            $pendingOrders = $query;
        } catch (DatabaseException $e) {
            // handle error if needed
        }

        // Total feedback count
        $totalFeedback = 0;
        try {
            $query = $db->table('feedback')->countAllResults();

SELECT *
FROM `customer_information`
WHERE `customer_information`.`id` = '21'
SELECT *
FROM `order_details`
WHERE `order_id` = '21'
SELECT *
FROM `product`
WHERE `product`.`productID` = '26'
---
    public function orders($status) {
        $session = session();
        if (!$session->get('username')) {
            return redirect()->to('/admin');
        }
        $orderModel = new OrderModel();
        $customerModel = new CustomerInformationModel();
        $orderDetailsModel = new OrderDetailsModel();
        $productModel = new ProductsModel();

        $query = $orderModel
        ->where('payment_status', $status)
        ->where('order_status !=', 'Done');

        // ✅ If Confirmed and date is provided in GET
        if (strtolower($status) == 'confirmed' && $this->request->getGet('filterDate')) {
            $date = $this->request->getGet('filterDate');
            $query->where('desired_date', $date);
        } elseif (strtolower($status) == 'pending' && $this->request->getGet('searchGcash')) {
            $search = $this->request->getGet('searchGcash');
            $query->like('transaction_id', $search);
        }

        $orders = $query->findAll();
        log_message('debug', 'Order Status ' . $status);
        foreach ($orders as &$order) {
            $order['customer'] = $customerModel->find($order['customer_id']);
            $details = $orderDetailsModel->where('order_id', $order['id'])->findAll();
            foreach ($details as &$detail) {
                $product = $productModel->find($detail['product_id']);

SELECT *
FROM `orders`
WHERE `orders`.`id` = '27'
SELECT *
FROM `customer_information`
WHERE `customer_information`.`id` = '27'
UPDATE `orders` SET `payment_status` = 'Confirmed'
WHERE `orders`.`id` IN ('27')
---
    public function confirmOrder($orderId) {
        $orderModel = new OrderModel();
        $customerModel = new CustomerInformationModel();

        $order = $orderModel->find($orderId);
        $customer = $customerModel->find($order['customer_id']);

        $email = \Config\Services::email();
        $email->setFrom('coconuts1403@gmail.com', 'Apollo XIII');
        $email->setTo($customer['email']);
        $email->setSubject('Order Confirmed');
        $email->setMessage('Dear ' . esc($customer['first_name']) . ',<br>Your order #' . $orderId . ' has been <b>confirmed</b>.');

        if ($email->send()) {
            $orderModel->update($orderId, ['payment_status' => 'Confirmed']);

SELECT *
FROM `orders`
WHERE `orders`.`id` = '19'
SELECT *
FROM `customer_information`
WHERE `customer_information`.`id` = '19'
UPDATE `orders` SET `payment_status` = 'Declined'
WHERE `orders`.`id` IN ('19')
---
    public function declineOrder($orderId){
        $orderModel = new OrderModel();
        $customerModel = new CustomerInformationModel();

        $order = $orderModel->find($orderId);
        $customer = $customerModel->find($order['customer_id']);

        $email = \Config\Services::email();
        $email->setFrom('coconuts1403@gmail.com', 'Apollo XIII');
        $email->setTo($customer['email']);
        $email->setSubject('Order Declined');
        $email->setMessage('Dear ' . esc($customer['first_name']) . ',<br>Your order #' . $orderId . ' has been <b>declined</b>.');

        if ($email->send()) {
            $orderModel->update($orderId, ['payment_status' => 'Declined']);

SELECT `o`.`id`, `o`.`order_type`, `o`.`customer_id`, `o`.`order_status`, `c`.`email`, `c`.`first_name`
FROM `orders` `o`
JOIN `customer_information` `c` ON `c`.`id` = `o`.`customer_id`
WHERE `o`.`id` = '23'
UPDATE `orders` SET `order_status` = 'Ready'
WHERE `orders`.`id` IN ('23')
---
    public function orderReady($orderId) {
        $session = session();
        $orderModel = new OrderModel();
        $db = \Config\Database::connect();
        $email = \Config\Services::email();

        $order = $db->table('orders o')
            ->select('o.id, o.order_type, o.customer_id, o.order_status, c.email, c.first_name')
            ->join('customer_information c', 'c.id = o.customer_id')
            ->where('o.id', $orderId)
            ->get()
            ->getRowArray();

        if (!$order) {
            $session->setFlashdata('error', 'Order not found.');
            return redirect()->to('/admin/orders/pending');
        }

        $subject = '';
        $message = '';
        $orderModel->update($orderId, ['order_status' => 'Ready']);

SELECT *
FROM `orders`
WHERE `orders`.`id` = '25'
UPDATE `orders` SET `order_status` = 'Done'
WHERE `orders`.`id` IN ('25')
---
    public function completeOrder($orderID) {
        $session = session();
        $orderModel = new OrderModel();

        $order = $orderModel->find($orderID);
        if (!$order) {
            $session->setFlashdata('error', 'Order not found.');
            return redirect()->back();
        }

        $orderModel->update($orderID, ['order_status' => 'Done']);

SELECT *
FROM `orders`
WHERE `order_status` = 'Done'
SELECT *
FROM `customer_information`
WHERE `customer_information`.`id` = '22'
SELECT *
FROM `order_details`
WHERE `order_id` = '22'
SELECT *
FROM `product`
WHERE `product`.`productID` = '29'
---
    public function sales(){
        helper('url');
        $session = session();
        $orderModel = new OrderModel();
        $customerModel = new CustomerInformationModel();
        $orderDetailsModel = new OrderDetailsModel();
        $productModel = new ProductsModel();

        if ($this->request->getMethod() === 'POST') {
            $date = $this->request->getPost('date');

            return redirect()->to('admin/sales' . ($date ? '?date=' . $date : ''));
        }

        $date = $this->request->getGet('date');

        if (!empty($date)) {
            $orders = $orderModel
                ->where('order_status', 'Done')
                ->where('DATE(created_at)', $date) // MySQL DATE() function
                ->findAll();
        } else {
            $orders = $orderModel
                ->where('order_status', 'Done')
                ->findAll();
        }

        foreach ($orders as &$order) {
            $order['customer'] = $customerModel->find($order['customer_id']);
            $details = $orderDetailsModel->where('order_id', $order['id'])->findAll();
            foreach ($details as &$detail) {
                $product = $productModel->find($detail['product_id']);