app/Controllers/Admin.php

    public function sales(){
        helper('url');
        $session = session();
        $orderModel = new OrderModel();
        $customerModel = new CustomerInformationModel();
        $orderDetailsModel = new OrderDetailsModel();
        $productModel = new ProductsModel();

        if ($this->request->getMethod() === 'POST') {
            $date = $this->request->getPost('date');

            return redirect()->to('admin/sales' . ($date ? '?date=' . $date : ''));
        }

        $date = $this->request->getGet('date');

        if (!empty($date)) {
            $orders = $orderModel
                ->where('payment_status', 'Confirmed')
                ->where('DATE(created_at)', $date) // MySQL DATE() function
                ->findAll();
        } else {
            $orders = $orderModel
                ->where('payment_status', 'Confirmed')
                ->findAll();
---
SELECT *
FROM `orders`
WHERE `payment_status` = 'Confirmed'