app/Controllers/Users.php

UPDATE `cart_items` SET `quantity` = 2, `total` = '1000.00'
WHERE `cart_items`.`id` IN ('33')
---
    public function updateQuantity(){
        $session = session();
        $cartModel = new \App\Models\CartModel();

        $itemId = $this->request->getPost('item_id');
        $newQty = (int) $this->request->getPost('quantity');

        if (!$itemId || $newQty < 1) {
            $session->setFlashdata('error', 'Invalid quantity or item.');
            return redirect()->to('/cart');
        }

        $item = $cartModel->find($itemId);
        if (!$item) {
            $session->setFlashdata('error', 'Item not found.');
            return redirect()->to('/cart');
        }

        $newTotal = number_format($item['total'] / $item['quantity'] * $newQty, 2, '.', '');

        $cartModel->update($itemId, [
            'quantity' => $newQty,
            'total'    => $newTotal
        ]);