app/Models/CategoryModel.php

SELECT *
FROM `category`
---
    public function getAllCategory($categoryID = False){
        if ($categoryID === False) {
            return $this->findAll();