app/Models/NotificationModel.php

    public function countUnreadNotification($userId) {
        return $this->where('is_read', 0)
                ->where('reference_id', $userId)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `is_read` = 0
AND `reference_id` IS NULL