app/Models/OrderModel.php

    public function getTotalSales(){
        return $this->selectSum('total')
                ->where('order_status', 'Done')
                ->get()
                ->getRow()
                ->total;
---
SELECT SUM(`total`) AS `total`
FROM `orders`
WHERE `order_status` = 'Done'