app/Models/ProductsModel.php

SELECT `product`.*, `category`.`CategoryName`
FROM `product`
JOIN `category` ON `category`.`CategoryID` = `product`.`categoryID`
---
    public function getAllProducts($categoryID = False){
        $builder = $this->select('product.*, category.CategoryName')
                    ->join('category', 'category.CategoryID = product.categoryID');

        if ($categoryID) {
            $builder->where('product.categoryID', $categoryID);
        }

        return $builder->findAll();